Repository: pypi-data/pypi-mirror-254
Catalog: packages/pyams-auth-sql/pyams_auth_sql-2.0.1.tar.gz/pyams_auth_sql-2.0.1/src/pyams_auth_sql/locales/*/LC_MESSAGES/pyams_auth_sql.po
Languages: fr

source: SQL engine
fr: Connexion SQL

source: SQLAlchemy engine used for database connection
fr: Nom de la connexion SQL utilisée

source: Schema name
fr: Schéma

source: Database schema name
fr: Nom du schéma de bases de données, si ce n'est pas le schéma de connexion

source: Table name
fr: Nom de table

source: Users table name
fr: Nom de la table contenant les comptes utilisateurs

source: Login field name
fr: Identifiant de connexion

source: Field name used to store login information
fr: Nom de l'attribut contenant l'identifiant de connexion

source: Password field name
fr: Mot de passe

source: Field name used to store encoded password
fr: Nom de l'attribut contenant le mot de passe encodé

source: Title format
fr: Formattage du libellé

source: Principal's title format string
fr: Chaîne de formattage utilisée pour définir le nom complet d'un utilisateur

source: Search attributes
fr: Attributs de recherche

source: Users will be searched against these attributes, which can be provided by separating them with commas; login attribute is automatically selected
fr: Vous pouvez rechercher un utilisateur à l'aide de ces attributs ; vous pouvez indiquer plusieurs attributs en les séparant par une virgule, l'identifiant de connexion étant sélectionné automatiquement

source: Allow login with email
fr: Connexion via l'adresse mail

source: If 'yes', users can log in using their email address or their base login
fr: Si 'oui', les utilisateurs peuvent se connecter également en utilisant leur adresse de messagerie

source: Email field name
fr: Adresse de messagerie

source: Field name used to store email address
fr: Nom de l'attribut contenant l'adresse de messagerie

source: Add SQL authentication plugin...
fr: Ajouter un annuaire SQL...

source: Add SQL authentication plug-in
fr: Ajout d'un annuaire SQL

source: SQL authentication plug-in
fr: Annuaire SQL

source: Users search form
fr: Rechercher des utilisateurs

source: Login
fr: Identifiant

source: Name
fr: Nom

source: Email
fr: Adresse de messagerie

source: Search results
fr: Résultats de la recherche
